In [1]:
import pandas as pd

In [2]:
df_raw = pd.read_excel("Tair.xlsx")
print(df_raw.shape)
df_raw.head()

(8761, 3)

                  Date                Time        Ta
0           [dd/mm/yyy                 NaT      [ｰC]
1  2013-01-01 00:00:00 2013-01-01 00:00:00  7.323167
2  2013-01-01 01:00:00 2013-01-01 01:00:00  7.374667
3  2013-01-01 02:00:00 2013-01-01 02:00:00  7.458833
4  2013-01-01 03:00:00 2013-01-01 03:00:00     7.628

In [18]:
df = df_raw.drop(index=0).reset_index().drop(columns="index")
print(df.shape)
df.head()

(8760, 3)

                  Date                Time        Ta
0  2013-01-01 00:00:00 2013-01-01 00:00:00  7.323167
1  2013-01-01 01:00:00 2013-01-01 01:00:00  7.374667
2  2013-01-01 02:00:00 2013-01-01 02:00:00  7.458833
3  2013-01-01 03:00:00 2013-01-01 03:00:00     7.628
4  2013-01-01 04:00:00 2013-01-01 04:00:00  7.971667

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8760 entries, 0 to 8759
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    8760 non-null   datetime64[ns]
 1   Time    8760 non-null   datetime64[ns]
 2   Ta      8760 non-null   object
dtypes: datetime64[ns](2), object(1)
memory usage: 205.4+ KB

In [26]:
df['Date'] = pd.to_datetime(df['Time'].dt.date)
df.head()

        Date                Time        Ta
0 2013-01-01 2013-01-01 00:00:00  7.323167
1 2013-01-01 2013-01-01 01:00:00  7.374667
2 2013-01-01 2013-01-01 02:00:00  7.458833
3 2013-01-01 2013-01-01 03:00:00     7.628
4 2013-01-01 2013-01-01 04:00:00  7.971667

In [38]:
daily_temp = df.groupby('Date')['Ta'].agg(T_Min='min', T_Max='max').reset_index()
daily_temp.head()

        Date     T_Min     T_Max
0 2013-01-01  3.771667    8.5615
1 2013-01-02  2.578167  8.007667
2 2013-01-03    7.1505  9.937167
3 2013-01-04    8.2335  9.156667
4 2013-01-05  6.809667  8.656833

In [40]:
t_base = 10

daily_temp['GDD'] = ((daily_temp['T_Min'] + daily_temp['T_Max']) / 2) - t_base
daily_temp.head()

        Date     T_Min     T_Max       GDD
0 2013-01-01  3.771667    8.5615 -3.833417
1 2013-01-02  2.578167  8.007667 -4.707083
2 2013-01-03    7.1505  9.937167 -1.456167
3 2013-01-04    8.2335  9.156667 -1.304917
4 2013-01-05  6.809667  8.656833  -2.26675

-1e-06

In [43]:
x = daily_temp['GDD']
daily_temp['LAI'] = (-4e-06 * (x**2)) + (0.012 * x) - 3.39
daily_temp.head()

        Date     T_Min     T_Max       GDD       LAI
0 2013-01-01  3.771667    8.5615 -3.833417  -3.43606
1 2013-01-02  2.578167  8.007667 -4.707083 -3.446574
2 2013-01-03    7.1505  9.937167 -1.456167 -3.407482
3 2013-01-04    8.2335  9.156667 -1.304917 -3.405666
4 2013-01-05  6.809667  8.656833  -2.26675 -3.417222